export const positionChampionList = {
    top: [
        // 전사/탱커/브루저 계열
        "가렌", "갱플랭크", "그웬", "나르", "나서스", "다리우스", "레넥톤", "리븐", 
        "마오카이", "말파이트", "모데카이저", "문도 박사", "볼리베어", "브라이어", 
        "블라디미르", "사이온", "세트", "쉔", "신지드", "아트록스", "오른", 
        "올라프", "우디르", "우르곳", "이렐리아", "일라오이", "자크", "잭스", 
        "제이스", "초가스", "카밀", "케넨", "퀸", "크산테", "클레드", "탐 켄치", 
        "트런들", "트린다미어", "판테온", "피오라", "하이머딩거", "요네", "야스오", 
        "요릭", "나피리", "럼블", "뽀삐", "암베사", "오공", "티모", "판테온", "그라가스"
    ],
    jgl: [
        // 정글링 효율적이고 갱킹 능력이 뛰어난 챔피언
        "그레이브즈", "녹턴", "누누와 윌럼프", "니달리", "다이애나", "람머스", 
        "렉사이", "렝가", "리신", "릴리아", "마스터이", "바이", "벨베스", 
        "비에고", "샤코", "쉬바나", "스카너", "신 짜오", "아무무", "아이번", 
        "워윅", "이블린", "자르반 4세", "카직스", "케인", "킨드레드", "피들스틱", 
        "헤카림", "럼블", "뽀삐", "티모", "판테온",
        // 부 포지션으로 정글 가능한 챔피언
        "가렌", "그라가스", "그웬", "다리우스", "마오카이", "말파이트", "브라이어", 
        "세주아니", "오공", "올라프", "우디르", "자크", "잭스", "초가스"
    ],
    mid: [
        // 마법사/암살자 계열
        "아리", "아칼리", "애니비아", "애니", "아우렐리온 솔", "아지르", 
        "카시오페아", "코르키", "에코", "피즈", "갈리오", "카사딘", "카타리나", 
        "케일", "르블랑", "리산드라", "말자하", "니코", "오리아나", "키아나", 
        "라이즈", "사일러스", "신드라", "탈론", "탈리야", "트위스티드 페이트", 
        "베이가", "벡스", "빅토르", "제드", "조이", "자이라", "제라스", "아크샨", "직스", "브랜드", "카르마", "나서스",
        // 부 포지션으로 미드 가능한 챔피언
        "가렌", "그라가스", "브랜드", "카르마", "나서스", "야스오", "요네", "스웨인", "판테온"
    ],
    ad: [
        // 원거리 딜러
        "애쉬", "카이사", "케이틀린", "드레이븐", "이즈리얼", "진", "징크스", 
        "칼리스타", "코그모", "루시안", "미스 포츈", "닐라", "사미라", "세나", 
        "시비르", "트리스타나", "트위치", "베인", "바루스", "제리", "자야", 
        "아펠리오스","직스", "스웨인"
    ],
    spt: [
        // 지정 서포터
        "바드", "블리츠크랭크", "브라움", "카르마", "럭스", "룰루", "레오나", 
        "밀리오", "모르가나", "나미", "노틸러스", "파이크", "라칸", "렐", 
        "레나타 글라스크", "세나", "세라핀", "쓰레쉬", "타릭", "탐 켄치", "질리언", 
        "소나", "소라카", "유미", "벨코즈", "잔나", "알리스타",
        // 부 포지션으로 서포터 가능한 챔피언
        "브랜드", "리산드라", "스웨인", "탈리야", "자이라", "제라스"
    ]
}

